# Pandas - grupowanie

### importy

In [1]:
import pandas as pd
import numpy as np

### dataset

In [2]:
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Zad. 1. Podaj średni, maksymalny i minimalny wiek dla każdej płci i zawodu.

In [3]:
grupowanie1 = users.groupby('occupation')['age'].agg([min, max, np.mean])
grupowanie2 = users.groupby('gender')['age'].agg([min, max, np.mean])
grupowanie1, grupowanie2

(               min  max       mean
 occupation
 administrator   21   70  38.746835
 artist          19   48  31.392857
 doctor          28   64  43.571429
 educator        23   63  42.010526
 engineer        22   70  36.388060
 entertainment   15   50  29.222222
 executive       22   69  38.718750
 healthcare      22   62  41.562500
 homemaker       20   50  32.571429
 lawyer          21   53  36.750000
 librarian       23   69  40.000000
 marketing       24   55  37.615385
 none            11   55  26.555556
 other           13   64  34.523810
 programmer      20   63  33.121212
 retired         51   73  63.071429
 salesman        18   66  35.666667
 scientist       23   55  35.548387
 student          7   42  22.081633
 technician      21   55  33.148148
 writer          18   60  36.311111,
         min  max       mean
 gender
 F        13   70  33.813187
 M         7   73  34.149254)

### Zad. 2. Podaj najpopularniejszy zawód wśród kobiet.

In [4]:
users[users.gender == 'F'].occupation.value_counts()

student          60
administrator    36
other            36
librarian        29
educator         26
writer           19
artist           13
healthcare       11
marketing        10
homemaker         6
programmer        6
none              4
scientist         3
executive         3
salesman          3
engineer          2
entertainment     2
lawyer            2
technician        1
retired           1
Name: occupation, dtype: int64

### Zad. 3. W którym zawodzie pracują średnio najstarsze osoby?

In [5]:
female_users = users[users.gender == 'F']
female_users

female_users.occupation[(female_users.age > female_users.age.mean())] # wszystkie zawody kobiece wieksze od sredniej

user_id
2           other
11          other
15       educator
18          other
20      homemaker
          ...
909      educator
911        writer
914         other
938    technician
942     librarian
Name: occupation, Length: 127, dtype: object

### Przykład dla polecenia: Zgrupuj po kombinacjach dwóch wartości - zawód i płeć. Podaj średni wiek dla każdej kombinacji.

In [6]:
users.groupby(['occupation', 'gender']).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

### Dodawanie kolumny z 2 pierwszymi cyframi kodu zamieszkania

In [7]:
users.location_code = users.zip_code.astype(str).str[:2]

<ipython-input-7-5720e1d69daf>:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  users.location_code = users.zip_code.astype(str).str[:2]

In [8]:
users.location_code

user_id
1      85
2      94
3      32
4      43
5      15
       ..
939    33
940    02
941    97
942    78
943    77
Name: zip_code, Length: 943, dtype: object

### Zad.4. Wybierz tylko użytkowników powyżej 30 roku życia. Zgrupuj po kombinacjach dwóch wartości - kod i płeć. Podaj średni wiek dla każdej kombinacji.

In [15]:
users_age = users[users.age < 30]

In [26]:
users_age.groupby('gender')['age'].agg([min, max, sum, np.mean])

        min  max   sum       mean
gender
F        13   29  2661  22.743590
M         7   29  6815  23.339041

In [27]:
users_age.groupby('zip_code')['age'].agg([min, max, sum, np.mean])

          min  max  sum  mean
zip_code
01002      29   29   29  29.0
01375      23   23   23  23.0
02113      27   27   27  27.0
02125      23   23   23  23.0
02136      14   14   14  14.0
...       ...  ...  ...   ...
E2E3R      21   21   21  21.0
N2L5N      27   27   27  27.0
N4T1A      21   21   21  21.0
R3T5K      22   22   22  22.0
V5A2B      29   29   29  29.0

[357 rows x 4 columns]